// 3. Напишите программу вычисления функции:
//    y = f(x)

string s_x = Console.ReadLine();
int x = int.Parse(s_x);
int y = -2 * (x * x) + 4 * x + 2;

Console.WriteLine(y);
