// **. Напишите программу, которая на вход принимает значение, а
// на выходе показывает обратное значение.

float N = float.Parse(Console.ReadLine());

Console.Write($"{N} -> {1 / N}");